[
    {
        "title": "Chimichurri Wings",
        "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/465250.jpg?resize=300:*&output-format=jpg&output-quality=auto",
        "sectionsAndIngredients": {
            "Ingredients": [
                "1 large shallot, minced",
                "5 cloves garlic, minced",
                "1 large jalapeño, minced",
                "½ cup red wine vinegar",
                "2 teaspoons kosher salt",
                "1 teaspoon freshly ground black pepper",
                "1 teaspoon red pepper flakes",
                "¼ cup finely chopped fresh parsley",
                "¼ cup finely chopped fresh cilantro",
                "½ cup extra-virgin olive oil",
                "1 lb chicken wings"
            ]
        },
        "servings": "for 4 servings",
        "description": "Try these herby, garlicky wings for game day or any day!",
        "steps": [
            "In a large bowl, combine the shallot, garlic, jalapeño, and red wine vinegar. Let sit for about 10 minutes.",
            "Season the mixture with the salt, black pepper, and red pepper flakes. Add the parsley and cilantro and mix to incorporate.",
            "While whisking, slowly and evenly stream in the olive oil. The chimichurri should be thick and slightly chunky.",
            "Add the chicken wings to a baking dish or large bowl. Pour about two-thirds of the chimichurri sauce evenly over the wings (reserve the rest for serving). Cover and marinate in the refrigerator for at least 2 hours, or overnight.",
            "Preheat oven to 400°F (200°C) and line a large baking sheet with parchment paper.",
            "Arrange the marinated wings on the prepared baking sheet, spacing about 1 inch apart. Bake for 45 minutes, or until deep golden brown and the internal temperature reaches 165°F (75°C).",
            "Serve the wings immediately with the reserved chimichurri sauce for dipping.",
            "Enjoy!"
        ],
        "tags": [
            "Appliance",
            "Baking",
            "Chicken",
            "High-Protein",
            "Under 1 Hour",
            "Weeknight",
            "Party",
            "Game Day",
            "Dinner",
            "Appetizers",
            "Easy",
            "Low-Carb",
            "Healthy",
            "Gluten-Free",
            "Dairy-Free"
        ],
        "nutritionalInfo": [
            "Calories 468",
            "Fat 43g",
            "Carbs 1g",
            "Fiber 25g",
            "Sugar 0g",
            "Protein 17g"
        ]
    },
    {
        "title": "Miso Herb Butter Corn Ribs",
        "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/465249.jpg?resize=300:*&output-format=jpg&output-quality=auto",
        "sectionsAndIngredients": {
            "Ingredients": [
                "4 ears corn, shucked",
                "4 tablespoons olive oil",
                "1 tablespoon sesame oil",
                "1 teaspoon kosher salt"
            ],
            "Miso Herb Butter": [
                "1 cup unsalted butter, softened",
                "3 tablespoons brown miso",
                "¼ cup finely chopped fresh parsley",
                "3 tablespoons thinly sliced fresh basil",
                "1 teaspoon kimchi salt",
                "2 tablespoons lemon juice"
            ],
            "Special Equipment": [
                "air fryer"
            ]
        },
        "servings": "for 4 servings",
        "description": "Here’s a fun dish to try with the last bit of corn this summer season!",
        "steps": [
            "Carefully break the ears of corn in half crosswise, then quarter lengthwise with a sharp knife.",
            "Add the corn ribs to a large bowl. Drizzle with the olive oil and sesame oil and sprinkle with the salt, then toss until evenly coated.",
            "Preheat the air fryer to 400°F (200°C) for 5 minutes.",
            "Working in batches, add the corn ribs to the air fryer basket, spacing a few centimeters apart. Cook for 10–12 minutes, or until golden brown.",
            "Make the miso herb butter: In the bowl of a stand mixer fitted with the paddle attachment, combine the butter, miso, parsley, basil, kimchi salt, and lemon juice. Mix on medium speed until well combined.",
            "Just before serving, melt the miso herb butter. Dip the corn ribs into the melted butter, or pour over the corn ribs to coat.",
            "Enjoy!"
        ],
        "tags": [
            "Appliance",
            "Air Fryer",
            "Asian",
            "Under 1 Hour",
            "Under 45 Minutes",
            "Summer",
            "Appetizers",
            "Under 30 Minutes",
            "Easy",
            "Vegetarian",
            "Gluten-Free"
        ],
        "nutritionalInfo": []
    },
    {
        "title": "Taco-Spiced Crispy Potato Skins",
        "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/464493.jpg?resize=300:*&output-format=jpg&output-quality=auto",
        "sectionsAndIngredients": {
            "Ingredients": [
                "8 medium russet potatoes, scrubbed",
                "¼ cup neutral oil, plus 2 tablespoons, divided",
                "1 lb 85% lean ground beef",
                "1 oz McCormick® Original Taco Seasoning",
                "kosher salt, to taste",
                "1 cup shredded cheddar cheese"
            ],
            "For Garnish": [
                "sour cream",
                "thinly sliced scallion",
                "small diced avocado"
            ]
        },
        "servings": "for 4 servings",
        "description": "The only seasoning you’ll need to get these potato skins in your hands is the McCormick® Original Taco Seasoning. Melty cheese, sour cream, and avocado take these poppable bites to the next level.",
        "steps": [
            "Preheat the oven to 425°F (220°C). Line a baking sheet with aluminum foil.",
            "Using a fork, poke holes all along the top of the potatoes. Place on the prepared baking sheet and cover with foil. Bake for 50–60 minutes, or until tender enough to be pierced by a fork. Remove from the oven and let cool until safe to handle, about 20 minutes.",
            "Meanwhile, make the ground beef. In a large skillet, heat 2 tablespoons of oil over medium heat until shimmering. Add the ground beef and the majority of the McCormick® Original Taco Seasoning (saving a teaspoon for garnish). Cook, stirring to crumble the meat, until three-quarters of the way cooked through, 6–8 minutes. Remove the pan from the heat.",
            "Cut the potatoes in half lengthwise and scoop out the insides, leaving about ¼ inch of the flesh in the potato around the edges.",
            "Brush the skins with remaining ¼ cup of oil and season with salt. Arrange the potatoes, cut-side down, on the same baking sheet and bake for 15 minutes, or until light golden brown.",
            "Remove the pan from the oven and flip the potato skins cut-side up, then fill with the ground beef and top with cheddar cheese. Bake for another 5 minutes, or until the cheese is melted and the potatoes are golden brown and crispy. Remove from the oven and let cool for 5–10 minutes.",
            "Garnish the potato skins with a dollop of sour cream, scallions, avocado, and sprinkle of the reserved McCormick® Original Taco Seasoning.",
            "Enjoy!"
        ],
        "tags": [
            "Under 1 Hour",
            "Meal Prep",
            "Mashup",
            "Weeknight",
            "Party",
            "Game Day",
            "Snacks",
            "Kid-Friendly",
            "Dinner",
            "Appetizers",
            "Easy",
            "Vegetarian",
            "Vegan",
            "Gluten-Free",
            "Dairy-Free",
            "Comfort Food",
            "Mexican",
            "North American"
        ],
        "nutritionalInfo": [
            "Calories 1146",
            "Fat 51g",
            "Carbs 114g",
            "Fiber 10g",
            "Sugar 5g",
            "Protein 53g"
        ]
    },
    {
        "title": "Crawfish Onigiri",
        "image": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/video-api/assets/464225.jpg?resize=300:*&output-format=jpg&output-quality=auto",
        "sectionsAndIngredients": {
            "Ingredients": [
                "12 oz cooked crawfish tail meat (345 g)",
                "2 tablespoons japanese mayonnaise",
                "1 ½ teaspoons wasabi paste",
                "1 teaspoon sugar",
                "1 cup cooked rice (200 g)",
                "1 tablespoon furikake",
                "1 ½ teaspoons black sesame seeds",
                "2 sheets nori, split in half (you will only use 3)"
            ]
        },
        "servings": "for 3 onigiri",
        "description": "Onigiri are essentially seasoned rice balls wrapped in nori and the filling options are endless! You can try out different flavor combinations to find your favorite–we love this creamy wasabi-coated crawfish.",
        "steps": [
            "In a medium bowl, toss the crawfish with the Japanese mayonnaise, wasabi, and sugar until well-coated.",
            "Season the cooked rice with the furikake and sesame seeds.",
            "Set an 8-inch square of plastic wrap on a flat surface.",
            "Scoop about ⅓ cup of the rice onto the plastic wrap and carefully spread out in a circle, about ¼-inch-thick.",
            "Add 2-3 tablespoons of the crawfish stuffing to the center of the rice and use the plastic wrap to help shape the onigiri into a ball or triangle shape, completely encasing the crawfish with the rice.",
            "Unwrap the plastic wrap, then wrap a half-sheet of nori around the rice ball. Repeat with the remaining ingredients to make 3 onigiri total.",
            "Serve immediately.",
            "Enjoy!"
        ],
        "tags": [
            "Snacks",
            "Lunch",
            "Under 30 Minutes",
            "Seafood",
            "Japanese"
        ],
        "nutritionalInfo": [
            "Calories 209",
            "Fat 9g",
            "Carbs 4g",
            "Fiber 0g",
            "Sugar 1g",
            "Protein 22g"
        ]
    },
    {
        "title": "Beef Gyudon",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "1 cup water",
                "1 ½ teaspoons dashi stock powder",
                "2 tablespoons mirin",
                "2 tablespoons sake",
                "3 tablespoons soy sauce",
                "2 tablespoons sugar"
            ],
            "Gyudon": [
                "½ large yellow onion, thinly sliced",
                "1 lb thinly sliced beef",
                "½ cup sliced green onions, divided",
                "3 cups cooked rice",
                "2 tablespoons fried garlic",
                "2 onsen eggs",
                "2 tablespoons sesame seeds",
                "2 tablespoons chili crisp oil"
            ]
        },
        "servings": "for 2 servings",
        "description": "This dish is found all over Japan and is oh-so-simple to make! It has savory, rich flavors from the dashi but Sarah's favorite part is the sweet onion cooked in the soup. This meal is perfect for a quick, filling, and comforting dinner.",
        "steps": [
            "Make the soup base: In a medium bowl, combine the water, dashi stock powder, mirin, sake, soy sauce, and sugar and stir until the solids are fully dissolved.",
            "Make the gyudon: Pour the soup base into a large pan over medium heat, then add the sliced onion and beef. Cover, bring to a simmer, and cook for 3-5 minutes, until the beef starts to cook through.",
            "Uncover the pan, skim off any scum from the surface, and continue to boil for about 4 minutes, until the liquid thickens just slightly. Stir in ¼ cup of the green onions.",
            "Add the rice to serving bowls, then ladle in the beef and soup mixture. Top with the remaining green onions, fried garlic, onsen eggs, sesame seeds, and chili crisp.",
            "Enjoy!"
        ],
        "tags": [
            "Cuisine",
            "Asian",
            "Japanese",
            "Beef",
            "Stove Top",
            "Under 30 Minutes"
        ],
        "nutritionalInfo": [
            "Calories 702",
            "Fat 27g",
            "Carbs 26g",
            "Fiber 3g",
            "Sugar 13g",
            "Protein 85g"
        ]
    },
    {
        "title": "Triple Cheese Potatoes Shreds Croquettes",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "½ cup ranch dressing (120 g)",
                "5.1 oz Idahoan® Triple Cheese Potato Shreds (20 g)"
            ],
            "Béchamel Sauce": [
                "1 tablespoon unsalted butter, plus 2 teaspoons",
                "1 tablespoon all-purpose flour, plus 2 teaspoons",
                "½ cup whole milk (120 mL)",
                "kosher salt, to taste",
                "freshly ground black pepper, to taste",
                "freshly grated nutmeg, to taste"
            ],
            "Assembly": [
                "½ cup all-purpose flour (60 g)",
                "2 large eggs",
                "2 cups panko bread crumbs (230 g)",
                "2 qt vegetable oil (1.8 L), for frying",
                "kosher salt, to taste"
            ],
            "Special Equipment": [
                "small half-round ice cube tray with at least 18 molds"
            ]
        },
        "servings": "for 9 croquettes",
        "description": "A creamy ranch-infused core is enveloped in cheesy potato shreds, then fried to a golden crisp perfection.",
        "steps": [
            "Pour the ranch dressing mixture into a small, half-round ice cube tray, filling 18 of the molds. Use an offset spatula to scrape away any excess so the dressing is flush with the top edges of each mold. Transfer to the freezer until the ranch is frozen solid, at least 2 hours, or preferably overnight.",
            "Cook the potato shreds according to the package instructions. Let cool while you make the sauce.",
            "Make the béchamel sauce: In a small saucepan over medium heat, melt the butter until it begins foaming. Add the flour and whisk to form a paste. Reduce the heat to medium and cook, whisking constantly, until the raw flour smell is gone but the flour has not browned, about 1 minute.",
            "While whisking constantly, slowly pour in the milk until incorporated. Continue to cook, stirring often, until the béchamel is thick enough to coat the back of a spoon, about 2 minutes. Season with salt, pepper, and nutmeg to taste. Let cool for 10 minutes.",
            "Add the potatoes to a large bowl with the béchamel sauce and use a rubber spatula to mix until evenly combined. Season with more salt, pepper, and/or nutmeg to taste, if needed.",
            "Assemble the croquettes: Line a quarter-sheet pan with parchment paper.",
            "Using a 2½-tablespoon cookie scoop or measuring spoon, scoop the potato mixture onto the prepared baking sheet; you should have 9 portions. Chill in the fridge until the potato balls are firm, about 1 hour.",
            "Remove the ranch ice cubes from the freezer, unmold, and press the halves together to make 9 balls.",
            "Remove the potato mixture from the freezer. Flatten one portion in your hand and place a ranch ball in the center. Wrap the potato mixture around the ranch ball to encase completely, then roll the potato mixture into a ball. Return to the baking sheet and repeat with the remaining potatoes and ranch balls. Cover loosely with plastic wrap and refrigerate until thoroughly chilled, about 1 hour. .",
            "Add the flour to a shallow bowl. Beat the eggs in a second shallow bowl. Process the panko bread crumbs in a food processor until finely ground, then transfer to a third shallow bowl.",
            "Roll each potato ball in the flour, then coat in the eggs, then roll in the bread crumbs to coat completely. Return to the prepared baking sheet and freeze while you heat the oil.",
            "Add the vegetable oil to a Dutch oven and heat over medium-high heat until the temperature reaches 350°F (180°C). Carefully add 3 croquettes at a time to hot oil using a spider or slotted spoon and fry, turning occasionally, until golden brown on all sides, about 90 seconds. Transfer the croquettes to a wire rack and season with salt. Let the oil return to 350°F (180°C) between batches.",
            "Serve immediately.",
            "Enjoy!"
        ],
        "tags": [
            "Cooking Style",
            "Deep-Fry",
            "Special Occasion",
            "Stove Top",
            "Dutch Oven",
            "Party",
            "Snacks",
            "Appetizers",
            "Easy",
            "Vegetarian",
            "Vegan",
            "Gluten-Free",
            "Dairy-Free",
            "Comfort Food"
        ],
        "nutritionalInfo": []
    },
    {
        "title": "Banana Cream Tiramisu",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "1 teaspoon granulated sugar",
                "1 teaspoon McCormick® Pure Vanilla Extract",
                "⅓ cup hot espresso (80 mL)",
                ".75 oz instant vanilla pudding mix (7 g)",
                "2 cups cold milk (480 mL)",
                "8 oz mascarpone (225 g), room temperature",
                "1 cup heavy cream (240 mL), very cold",
                "11 oz vanilla wafer cookies (310 g), plus more for garnish",
                "5 bananas, cut into ¼-inch-thick slices",
                "McCormick® Ground Cinnamon, for dusting"
            ]
        },
        "servings": "for 4 servings",
        "description": "Two favorite desserts, banana cream pie and tiramisu, are combined into one with McCormick® Pure Vanilla Extract providing a sweet depth to this delectable dessert. ",
        "steps": [
            "In a small bowl or measuring cup, combine the sugar, McCormick® Pure Vanilla Extract, and espresso. Stir to combine, then let cool to room temperature.",
            "In a large bowl, whisk together the vanilla pudding mix and milk until smooth. Set aside.",
            "In a separate large bowl, whisk the mascarpone and heavy cream until stiff peaks form, 6–8 minutes.",
            "Fold the whipped cream mixture into the vanilla pudding.",
            "Arrange a layer of vanilla wafers on the bottom of a medium baking dish or pie dish. Using a pastry brush, dab the espresso mixture on the tops of the cookies until slightly saturated. Arrange a layer of banana slices over the cookies, then spread an even layer of vanilla pudding on top. Repeat to make 3 layers total. Dust the top with McCormick® Ground Cinnamon.",
            "Cover the baking dish with plastic and refrigerate for at least 1 hour, or up to 1 day, until ready to serve.",
            "Serve with more vanilla wafers for topping.",
            "Enjoy!"
        ],
        "tags": [
            "Under 1 Hour",
            "Special Occasion",
            "One-Pot or Pan",
            "No Bake Desserts",
            "Mashup",
            "Baking",
            "Desserts",
            "Vegetarian",
            "Vegan",
            "Gluten-Free",
            "Dairy-Free",
            "Italian"
        ],
        "nutritionalInfo": [
            "Calories 771",
            "Fat 52g",
            "Carbs 77g",
            "Fiber 6g",
            "Sugar 50g",
            "Protein 10g"
        ]
    },
    {
        "title": "Baked Cinnamon Apple Pancake",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "4 large eggs",
                "1 cup milk (240 mL)",
                "2 teaspoons McCormick® Pure Vanilla Extract",
                "2 teaspoons McCormick® Ground Cinnamon",
                "½ teaspoon kosher salt",
                "3 tablespoons granulated sugar",
                "⅔ cup all-purpose flour (85 g), plus 2 tablespoons",
                "nonstick cooking spray, for greasing",
                "2 large Granny Smith apples, peeled and thinly sliced",
                "2 tablespoons unsalted butter, melted",
                "powdered sugar, for dusting"
            ]
        },
        "servings": "for 4 servings",
        "description": "Indulge in a delightful harmony of flavors with this baked cinnamon apple pancake — spiced up with McCormick® Ground Cinnamon. This oven-baked treat combines the warmth of cinnamon-spiced apples with the fluffy goodness of a classic pancake, and the best part is the batter can be prepped the night before for an easy breakfast. ",
        "steps": [
            "Whisk together the eggs, milk, and McCormick® Pure Vanilla Extract in a large bowl until combined. Add the McCormick® Ground Cinnamon, salt, granulated sugar, and flour and whisk until smooth. Transfer to an airtight container and refrigerate until ready to bake, up to 2 days. Note: For meal prep, make the batter the night before, then bake in the morning.",
            "Preheat the oven to 425°F (220°C). Line a baking sheet with parchment paper. Grease a 9 x 13-inch baking dish with nonstick spray.",
            "Arrange the apple slices flat on the prepared baking sheet and brush with the melted butter. Bake the apples for 10 minutes, or until tender. Let cool for 10–15 minutes, or until cool enough to handle.",
            "Remove the batter from the refrigerator and let sit at room temperature for 10 minutes. Pour the batter into the prepared baking dish. Arrange the baked apple slices in overlapping rows on top of the batter.",
            "Bake the pancake for 20–25 minutes, or until the batter is cooked through and golden brown. Remove from the oven and let cool for 8–10 minutes.",
            "Dust the pancake with powdered sugar and serve warm.",
            "Enjoy!"
        ],
        "tags": [
            "Pancakes",
            "Sweet Breakfasts",
            "Under 45 Minutes",
            "Mother's Day",
            "Big Batch",
            "Fall",
            "Baking",
            "Brunch",
            "Breakfast",
            "Easy",
            "Vegetarian",
            "Vegan",
            "Gluten-Free",
            "Dairy-Free",
            "Comfort Food"
        ],
        "nutritionalInfo": [
            "Calories 409",
            "Fat 14g",
            "Carbs 56g",
            "Fiber 10g",
            "Sugar 24g",
            "Protein 13g"
        ]
    },
    {
        "title": "French Onion Poutine",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "6 tablespoons unsalted butter",
                "1 large yellow onion, sliced into ¼-inch-thick half moons",
                "1 teaspoon McCormick® Dried Thyme Leaves, plus more for garnish",
                "1 ½ cups beef stock (360 mL)",
                ".87 oz McCormick® Brown Gravy (10 g)",
                "32 oz frozen crinkle fries (945 g), cooked according to package instructions",
                "1 cup shredded gruyère cheese (100 g)",
                "¾ cup cheese curds (175 g)"
            ]
        },
        "servings": "for 4 servings",
        "description": "Savor the rich fusion of flavors in this poutine, featuring a luscious gravy made with a packet of McCormick® Brown Gravy, golden crinkle fries, caramelized onions, and two types of cheese: Gruyère and cheese curds.",
        "steps": [
            "Melt the butter in a 12-inch cast iron skillet over medium-low heat. Add the onion and sprinkle with the McCormick® Dried Thyme Leaves. Cook, stirring and flipping the onions occasionally, until caramelized, 30–35 minutes. Remove about ⅓ cup of the onions from the pan and set aside.",
            "Pour the beef stock into the pan with the remaining onions, sprinkle in the McCormick® Brown Gravy, and whisk until smooth. Bring to a gentle simmer and cook, whisking constantly, until the gravy thickens, 2–3 minutes. Remove about half of the gravy from the pan and set aside.",
            "Layer half the fries on top of the remaining gravy in the pan, then top with half of the Gruyère and cheese curds. Repeat layering with the other half of the fries, remaining Gruyère and cheese curds, and reserved caramelized onions, then pour the rest of the gravy on top.",
            "Turn the broiler on high. Place the pan under the broiler for about 5 minutes, or until the cheese has melted and is golden brown.",
            "Garnish the poutine with more McCormick® Dried Thyme Leaves and serve warm.",
            "Enjoy!"
        ],
        "tags": [
            "Special Occasion",
            "Mashup",
            "Stove Top",
            "Cast Iron Pan",
            "Broiler",
            "Weeknight",
            "Party",
            "Game Day",
            "Snacks",
            "Dinner",
            "Appetizers",
            "Vegetarian",
            "Vegan",
            "Gluten-Free",
            "Dairy-Free",
            "Comfort Food",
            "French",
            "North American"
        ],
        "nutritionalInfo": [
            "Calories 565",
            "Fat 40g",
            "Carbs 27g",
            "Fiber 1g",
            "Sugar 7g",
            "Protein 20g"
        ]
    },
    {
        "title": "Dim Sum Shrimp Balls",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "12 oz wonton wrappers (345 g)",
                "2 lb raw shrimp (910 g), peeled and deveined",
                "¼ cup chopped green onions (10 g), plus more for garnish",
                "1 tablespoon soy sauce",
                "1 tablespoon fish sauce",
                "1 teaspoon kosher salt",
                "1 teaspoon freshly ground black pepper",
                "1 teaspoon sugar",
                "1 large egg",
                "2 tablespoons rice flour",
                "4 cups vegetable oil (960 mL)",
                "sweet chili sauce, for dipping"
            ]
        },
        "servings": "for 2 servings",
        "description": "You can find several different variations on crispy shrimp balls at dim sum restaurants, but this is Sarah's favorite kind, with shredded wonton wrappers for that added crunch and a nice, juicy shrimp filling that pairs perfectly with sweet chili dipping sauce. It’s a match made in heaven!",
        "steps": [
            "Finely chop the shrimp, then add to a large bowl with the green onions, soy sauce, fish sauce, salt, pepper, and sugar. Mix well. Add the egg and rice flour and stir; the mixture should thicken a bit.",
            "Use a sharp knife to shred the wonton wrappers into ½-inch-wide strips, then transfer to a separate large bowl.",
            "Scoop 2 tablespoons of the shrimp filling into the bowl with the shredded wrappers and pat firmly to cover the filling completely. Repeat to make about 6 balls total.",
            "In a large pot, heat the vegetable oil over medium-high heat until the temperature reaches 350°F (180°C).",
            "Working in batches, fry the shrimp balls in the hot oil for 5-6 minutes, or until the internal temperature reaches 145°F (63°C).",
            "Serve immediately with sweet chili sauce alongside for dipping.",
            "Enjoy!"
        ],
        "tags": [
            "Cuisine",
            "Asian",
            "Under 1 Hour",
            "Under 45 Minutes",
            "Pescatarian",
            "Stove Top",
            "Deep-Fry",
            "Appetizers",
            "Gluten-Free",
            "Dairy-Free",
            "Seafood"
        ],
        "nutritionalInfo": []
    },
    {
        "title": "Copycat Whole Foods Bean Salad",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "14 oz canned butter beans (405 g), drained",
                "1 tablespoon sunflower oil",
                "⅓ cup red wine vinegar (80 g)",
                "2 teaspoons kosher salt",
                "1 teaspoon freshly ground black pepper",
                "2 green onions, thinly sliced",
                "¼ cup finely chopped roasted red peppers (25 g)",
                "¼ cup finely chopped fresh parsley (10 g)"
            ]
        },
        "servings": "for 4 servings",
        "description": "Can’t stop thinking about the marinated beans from Whole Foods? Make your own version at home! They’re an absolutely delightful addition to any charcuterie board, but also make a great make-ahead lunch!",
        "steps": [
            "In a large bowl, toss together the beans, sunflower oil, red wine vinegar, salt, black pepper, green onions, roasted red peppers, and parsley until evenly combined. Let sit for at least 30 minutes to meld the flavors.",
            "Serve the bean salad on a charcuterie board, cheese plate, or eat as-is for a snack or for lunch. Any leftovers will keep in an airtight container in the refrigerator for up to 3 days.",
            "Enjoy!"
        ],
        "tags": [
            "Salads",
            "High-Fiber",
            "Appetizers",
            "Under 30 Minutes",
            "Easy",
            "Vegetarian",
            "Healthy"
        ],
        "nutritionalInfo": [
            "Calories 121",
            "Fat 3g",
            "Carbs 16g",
            "Fiber 29g",
            "Sugar 1g",
            "Protein 5g"
        ]
    },
    {
        "title": "Vietnamese Steamed Rice Rolls",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "½ lb bean sprouts (225 g)",
                "1 lb premade steamed rice sheet noodles (425 g)",
                "¼ lb chả lụa (Vietnamese ham) (105 g)",
                "1 english cucumber",
                "2 tablespoons fried garlic"
            ],
            "Nuoc Mam Sauce": [
                "1 cup hot water (240 g)",
                "¾ cup granulated sugar (150 g)",
                "3 tablespoons lime juice, (about 1 lime)",
                "1 cup coconut soda (240 mL), preferably Coco Rico brand",
                "¾ cup fish sauce (180 g), preferably Viet Huong's Three Crabs brand",
                "6 garlic cloves, thinly sliced or crushed",
                "2 Thai chiles, thinly sliced"
            ]
        },
        "servings": "for 4 servings",
        "description": "Every time I’m back home in Vietnam, I always opt to grab this super-accessible breakfast from a local food cart. It’s so quick and easy to recreate at home, not to mention delicious!!",
        "steps": [
            "Steam the bean sprouts for 5 minutes, until soft and pliable.",
            "Transfer the rice rolls to a bowl and microwave for 30-60 seconds, until soft.",
            "Slice the chả lụa into thin slabs.",
            "Use a julienne peeler or sharp knife to thinly slice the cucumber.",
            "Make the nuoc mam sauce: In a small bowl, stir together the water, sugar, lime juice, coconut soda, fish sauce, garlic, and chiles. (Any leftover sauce will keep in an airtight container in the refrigerator for up to 2 weeks.)",
            "Add the rice noodles to a serving plate and top with the steamed bean sprouts, julienned cucumber, chả lụa, fried garlic, and some of the nuoc mam sauce.",
            "Enjoy!"
        ],
        "tags": [
            "Cuisine",
            "Asian",
            "Vietnamese",
            "Under 1 Hour",
            "Under 45 Minutes",
            "One-Pot or Pan",
            "Microwave",
            "Breakfast",
            "Under 30 Minutes",
            "Easy",
            "Vegetarian",
            "Vegan",
            "Gluten-Free",
            "Dairy-Free"
        ],
        "nutritionalInfo": [
            "Calories 667",
            "Fat 8g",
            "Carbs 130g",
            "Fiber 3g",
            "Sugar 32g",
            "Protein 15g"
        ]
    },
    {
        "title": "Pad See Ew",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "1 lb protein of choice (425 g), such as beef, chicken, or tofu"
            ],
            "Marinade": [
                "2 tablespoons oyster sauce",
                "3 tablespoons soy sauce",
                "1 tablespoon dark soy sauce",
                "1 ½ teaspoons ground white pepper",
                "1 tablespoon sugar",
                "2 tablespoons cornstarch"
            ],
            "Sauce": [
                "3 tablespoons oyster sauce",
                "2 tablespoons sugar",
                "1 teaspoon ground white pepper",
                "3 tablespoons dark soy sauce",
                "1 tablespoon soy sauce"
            ],
            "Pad See Ew": [
                "½ white onion, sliced",
                "5 garlic cloves, minced",
                "2 cups Chinese broccoli (150 g)",
                "12 oz fresh rice noodles (300 g), or 1 12-ounce package of dried rice noodles",
                "2 large eggs, beaten"
            ]
        },
        "servings": "for 4 servings",
        "description": "This dish is a go-to for an easy dinner. It uses super-versatile sauce ingredients and you can substitute the protein and veggies for anything that you'd like. This keeps very well in the fridge, or share with your friends for a big study session!",
        "steps": [
            "Thinly slice your protein of choice. Transfer to a large bowl, add the oyster sauce, soy sauce, dark soy sauce, white pepper, and sugar and stir to coat the protein. Sprinkle with the cornstarch and massage to coat the protein evenly. Marinate in the refrigerator for 15-60 minutes.",
            "Make the sauce: In a small bowl, mix together the oyster sauce, sugar, white pepper, dark soy sauce, and soy sauce.",
            "In a large pan over high heat, fry the protein until it is about 80% done, about 6 minutes, then remove from the pan and set aside.",
            "Add the onion, garlic, and Chinese broccoli to the same pan and cook for about 3 minutes, until starting to soften, then add the noodles. Immediately add the sauce to the pan and gently toss until just combined.",
            "Push the noodles and veggies to one side of the pan and pour the eggs into the empty space. Scramble until just set, about 1 minute, then stir into the noodles and veggies.",
            "Add the protein and toss to combine.",
            "Serve immediately.",
            "Enjoy!"
        ],
        "tags": [
            "Cuisine",
            "Asian",
            "Thai",
            "Stir Fry",
            "Pan Fry",
            "Stove Top",
            "Lunch",
            "Dinner",
            "Under 30 Minutes"
        ],
        "nutritionalInfo": [
            "Calories 642",
            "Fat 8g",
            "Carbs 90g",
            "Fiber 3g",
            "Sugar 9g",
            "Protein 48g"
        ]
    },
    {
        "title": "Pumpkin Spice Crème Brûlée",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "5 large egg yolks",
                "1 cup granulated sugar (200 g), divided",
                "2 cups heavy cream (480 mL)",
                "3 teaspoons pumpkin spice mix",
                "2 teaspoons vanilla extract",
                "1 pinch of kosher salt",
                "2 cups hot water (480 mL), for baking",
                "6 ice cubes",
                "¼ cup room temperature water (60 mL)",
                "fresh fruit of choice, for garnish"
            ]
        },
        "servings": "for 4 servings",
        "description": "This is the perfect easy-yet-impressive dessert to make for a dinner party to wow all of your guests. It comes together with just a few ingredients and doesn't require any fancy kitchen equipment!",
        "steps": [
            "Preheat the oven to 325°F (160°C).",
            "In a large bowl, whisk together the egg yolks and ½ cup (200 G) sugar until smooth.",
            "Add the heavy cream to a medium pot and warm over medium heat just until steam starts rising from the surface, about 3 minutes. DO NOT let it boil! Add the pumpkin spice seasoning, vanilla, and salt and whisk to combine, then turn off the heat.",
            "While whisking, slowly pour about ½ cup of the hot cream into the egg and sugar mixture (this is called tempering, which gently heats the eggs without causing them to curdle).",
            "Slowly pour the egg mixture into the pot with the remaining heavy cream and whisk to combine. Pour the custard through a fine-mesh sieve into a medium bowl to remove any solids.",
            "Place 4-8 ramekins in a baking dish with sides the same height (or taller) than the ramekins. Ladle the egg mixture into the ramekins, dividing evenly. If you’d like, skim off excess foam on the surface.Carefully pour the hot water into the pan, being careful not to splash into the ramekins (the water bath will help the crème brûlée cook evenly).",
            "Carefully transfer the pan with the ramekins to the oven and, if desired, throw the ice cubes into the bottom of the oven to create a more humid baking environment. Bake for 35–40 minutes, or until the custard has set and the centers are only slightly jiggly.",
            "Remove from the oven and let cool at room temperature for 2 hours, then remove the ramekins from the water bath, cover, and refrigerate overnight.",
            "Before serving, melt together the remaining ½ cup sugar and the room temperature water in a medium pan over medium heat until deeply caramelized, 6–10 minutes. DO NOT STIR, just swirl the pan gently if needed to melt evenly. This ensures the caramel won’t crystallize.",
            "Pour the caramel into the ramekins, then quickly tilt the ramekins around to fully cover the custard. Let sit for a few minutes to solidify.",
            "Top with your fruit of choice and serve immediately.",
            "Enjoy!"
        ],
        "tags": [
            "Seasonal",
            "Holidays",
            "Thanksgiving",
            "Baking",
            "Desserts",
            "Halloween",
            "Comfort Food"
        ],
        "nutritionalInfo": [
            "Calories 613",
            "Fat 51g",
            "Carbs 40g",
            "Fiber 2g",
            "Sugar 39g",
            "Protein 13g"
        ]
    },
    {
        "title": "Balsamic & Blue Cheese Bison Burger",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "1 ½ lb ground bison (650 g)",
                "2 tablespoons balsamic vinegar",
                "2 teaspoons kosher salt",
                "2 teaspoons freshly ground black pepper",
                "6 tablespoons firm blue cheese, divided into 4 portions and rolled into balls"
            ],
            "Balsamic Mayonnaise": [
                "3 tablespoons mayonnaise",
                "2 teaspoons balsamic vinegar",
                "¼ teaspoon kosher salt",
                "½ teaspoon freshly ground black pepper"
            ],
            "Assembly": [
                "4 brioche hamburger buns, lightly toasted",
                "arugula",
                "pickled red onion",
                "1 can Bush's® Zero Sugar Added Baked Beans, warmed, for serving"
            ]
        },
        "servings": "for 4 servings",
        "description": "Celebrate grilling season with this unique burger recipe and Bush’s® Zero Sugar Added Baked Beans! ",
        "steps": [
            "Preheat the grill to 400°F (200°C).",
            "In a medium bowl, combine the ground bison, balsamic vinegar, salt, and pepper. Divide the meat into 4 equal portions. Flatten each portion of meat into a patty and place a blue cheese ball in the center. Roll the meat around the cheese to fully encase, then flatten into patties again.",
            "Make the balsamic mayonnaise: In a small bowl, whisk together the mayonnaise, balsamic vinegar, salt, and pepper. Set aside until ready to use.",
            "Place the burger patties on the grill grates and cook for 3 minutes per side, or until fully cooked through.",
            "Assemble the burgers: Place a patty on each bottom bun and top with arugula and pickled red onions. Spread the balsamic mayonnaise on the top buns, then close the burgers. Serve with Bush’s® Zero Sugar Added Baked Beans alongside.",
            "Enjoy!"
        ],
        "tags": [
            "Meal",
            "Dinner",
            "Burgers",
            "High-Protein",
            "Lunch"
        ],
        "nutritionalInfo": [
            "Calories 748",
            "Fat 41g",
            "Carbs 52g",
            "Fiber 33g",
            "Sugar 14g",
            "Protein 41g"
        ]
    },
    {
        "title": "Baked Bean Shepherd’s Pie",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "½ teaspoon kosher salt, plus more for boiling",
                "2 lb cauliflower florets (910 g), from about 2 medium heads",
                "2 tablespoons unsalted butter",
                "½ teaspoon garlic powder",
                "¼ cup grated parmesan cheese (25 g)",
                "½ cup half-and-half (120 mL), or as needed"
            ],
            "Filling": [
                "2 tablespoons olive oil",
                "1 large yellow onion, diced",
                "1 lb ground turkey (425 g)",
                "2 garlic cloves, minced",
                "2 tablespoons all-purpose flour",
                "2 tablespoons tomato paste",
                "½ cup red wine (120 mL)",
                "2 medium carrots, diced",
                "1 cup frozen peas (140 g)",
                "½ cup frozen corn (85 g)",
                "1 teaspoon fresh thyme leaves",
                "1 teaspoon minced fresh sage or rosemary leaves",
                "28 oz Bush's® Zero Sugar Added Baked Beans (825 g)",
                "¾ cup chicken broth (180 mL)",
                "½ teaspoon kosher salt, plus more to taste",
                "¼ teaspoon freshly ground black pepper",
                "¼ teaspoon paprika",
                "1 tablespoon finely chopped fresh parsley, for garnish"
            ]
        },
        "servings": "for 6 servings",
        "description": "Shepherd's pie gets a makeover this summer with Bush’s® Zero Sugar Added Baked Beans! ",
        "steps": [
            "Preheat the oven to 400°F (200°C).",
            "Make the cauliflower mash: Bring a large pot of salted water to a boil over medium-high heat.",
            "Add the cauliflower to the boiling water, cover, and cook for 10 minutes, or until the cauliflower is very tender, but not mushy. Drain the cauliflower, then transfer to a blender or food processor while still hot.",
            "Add the butter, garlic powder, and Parmesan to the blender with the cauliflower. Blend on medium high speed, adding the half-and-half a little at a time and stopping to scrape down the sides as needed, until the mash is smooth and fluffy, but not liquidy. It should be soft, but retain its shape when spooned out. You may not need all of the half-and-half. Set aside until ready to use.",
            "Make the filling: Heat the olive oil in a 12-inch cast iron skillet over medium-high heat. Add the onion and cook, stirring frequently, until soft and beginning to caramelize, 3–4 minutes. Add the ground turkey and cook until browned, then add the garlic and sauté for another minute, until fragrant. Stir in the flour, then the tomato paste, until well-distributed. Deglaze the pan with the red wine, scraping up any browned bits from the bottom of the pan. Bring to a boil for 2 minutes, until the wine begins to reduce and thicken. Add the carrots, peas, and corn, stirring to combine. Then, add the thyme, sage, Bush’s® Zero Sugar Added Baked Beans, chicken broth, salt, and pepper and stir to combine. Bring to a simmer and cook for 4–5 minutes, until the sauce reduces slightly and thickens.",
            "Smooth the top of the filling with a spatula or spoon, then cover evenly with the cauliflower mash, smoothing in an even layer and then using a fork to gently score the whole surface with ridges. Sprinkle with the paprika.",
            "Place the cast iron pan on a large baking dish to catch any drips, then bake for 35 minutes, or until the top is golden brown. If you prefer a darker brown top, broil on high for 3–4 minutes, watching carefully to avoid burning.",
            "Let the shepherd’s pie rest for 15 minutes to cool slightly, then serve garnished with parsley.",
            "Enjoy!"
        ],
        "tags": [
            "Cuisine",
            "European",
            "British",
            "Casseroles",
            "Mashup",
            "Dinner",
            "Comfort Food"
        ],
        "nutritionalInfo": [
            "Calories 514",
            "Fat 21g",
            "Carbs 57g",
            "Fiber 20g",
            "Sugar 20g",
            "Protein 29g"
        ]
    },
    {
        "title": "Southwestern Baked Bean Sweet Potatoes",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "6 medium sweet potatoes, scrubbed",
                "3 tablespoons olive oil",
                "1 tablespoon kosher salt, plus more to taste",
                "1 tablespoon freshly ground black pepper, plus more to taste",
                "1 cup canned corn (175 g)",
                "½ green bell pepper, small diced",
                "1 roma tomato, small diced",
                "¼ cup chopped fresh cilantro (10 g), plus more for garnish",
                "¼ medium red onion, diced",
                "1 ½ cups shredded rotisserie chicken (185 g)",
                "1 can Bush’s® Original Baked Beans",
                "shredded monterey jack cheese, for topping",
                "diced avocado, for serving",
                "sour cream, for serving"
            ]
        },
        "servings": "for 6 servings",
        "description": "Sweet potatoes +  Bush’s® Original Baked Beans = the ultimate baked potato recipe for your summer BBQ.  ",
        "steps": [
            "Add the sweet potatoes to a large pot and cover with cool water. Bring to a boil over medium heat and cook for 20–25 minutes, or until nearly tender, but not all the way cooked through.",
            "Preheat the oven to 375°F (190°C). Line a baking sheet with parchment paper.",
            "Transfer the sweet potatoes to the prepared baking sheet. Drizzle with the olive oil and sprinkle with the salt and black pepper. Bake the sweet potatoes for 10–12 minutes, or fully cooked through and the skin is slightly crispy. Remove from the oven.",
            "Meanwhile make the filling: In a large bowl, toss together the corn, bell pepper, tomato, cilantro, red onion, chicken, and Bush’s® Original Baked Beans until well-combined. Season with salt and pepper to taste. Set aside until ready to use.",
            "Turn the broiler on high.",
            "Cut an opening lengthwise down the center of each sweet potato. Stuff the potatoes with the filling, dividing evenly. Top with Monterey Jack cheese. Broil the stuffed sweet potatoes until the cheese is melted and golden brown, 2–3 minutes.",
            "Garnish each sweet potato with diced avocado, a dollop of sour cream, and more cilantro. Serve warm.",
            "Enjoy!"
        ],
        "tags": [
            "Cuisine",
            "North American",
            "Southwestern",
            "Chicken",
            "High-Fiber",
            "Stuffed",
            "Dinner"
        ],
        "nutritionalInfo": [
            "Calories 375",
            "Fat 9g",
            "Carbs 59g",
            "Fiber 31g",
            "Sugar 20g",
            "Protein 13g"
        ]
    },
    {
        "title": "Aperol Spritz Popsicles",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "1 large orange, zested",
                "¼ cup fresh orange juice (60 mL)",
                "¾ cup aperol (180 mL)",
                "⅔ cup soda water (160 mL)",
                "4 thin orange slices",
                "3 cups prosecco (750 mL)"
            ],
            "Special equipment": [
                "ice pop mold with sticks"
            ]
        },
        "servings": "for 4 servings",
        "description": "@alexawhatsfordinner is taking the Aperol spritz to the next level by making it a popsicle! The popsicle makes the drink super cold, refreshing, and delicious!",
        "steps": [
            "In a large bowl, stir together the orange zest and juice, Aperol, and soda water.",
            "Carefully pour the Aperol mixture into 4 ice pop molds, filling each about three-quarters of the way. Add an orange slice to each mold, then insert the sticks. Freeze for at least 8 hours, until completely solid.",
            "When ready to serve, pour the prosecco into large glasses. Remove the popsicles from the molds and place one upside down in each glass.",
            "Serve immediately.",
            "Enjoy!"
        ],
        "tags": [
            "Meal",
            "Drinks",
            "Cocktails",
            "Occasion",
            "Contains Alcohol",
            "Freezer Friendly",
            "Summer",
            "BBQ",
            "Desserts",
            "4th of July",
            "Easy"
        ],
        "nutritionalInfo": [
            "Calories 352",
            "Fat 0g",
            "Carbs 54g",
            "Fiber 7g",
            "Sugar 43g",
            "Protein 3g"
        ]
    },
    {
        "title": "Croque Madame Eggs En Cocotte",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "2 large eggs",
                "1 tablespoon heavy cream",
                "2 tablespoons Freshly grated Gruyère cheese",
                "2 tablespoons ham steak, cut into small cubes",
                "1 teaspoon kosher salt",
                "2 slices crusty bread",
                "1 tablespoon unsalted butter"
            ],
            "For Garnish": [
                "1 pinch of flaky sea salt",
                "freshly ground black pepper",
                "red pepper flake",
                "finely chopped fresh chive"
            ],
            "Special Equipment": [
                "small ramekin or cocotte with lid, or foil if the ramekin doesn't have a lid"
            ]
        },
        "servings": "for 1 serving",
        "description": "@alexawhatsfordinner is whipping up her favorite brunch, eggs en cocotte (baked eggs) with a Croque Madame twist! They’re creamy, comforting, and so delightful.",
        "steps": [
            "Preheat the oven to 350°F (180°C). Bring about 2 cups of water to a boil in a small saucepan.",
            "Carefully crack the eggs into a ramekin or small cocotte. Add the cream, kosher salt, Gruyère, and ham.",
            "Cover the ramekin with a lid or foil and place in a high-walled baking dish. Carefully pour the boiling water into the dish, so it comes about two-thirds of the way up the sides of the ramekin.",
            "Carefully transfer the entire dish to the oven and bake for 20 minutes, until the egg whites are cooked but the yolks are still runny.",
            "Meanwhile, heat a medium pan over medium-high heat. Spread the butter over both sides of the bread and toast in the pan for 2-3 minutes per side, until golden brown.",
            "Remove the baking dish from the oven and carefully lift the ramekin out.",
            "Garnish the eggs with flaky salt, black pepper, red pepper flakes, and chives. Serve with the toasted bread.",
            "Enjoy!"
        ],
        "tags": [
            "Meal",
            "Breakfast",
            "Egg Breakfasts",
            "Mashup",
            "Brunch",
            "Under 30 Minutes",
            "Comfort Food"
        ],
        "nutritionalInfo": []
    },
    {
        "title": "Elote-Inspired Corn Ribs",
        "image": "data:image/gif;base64,R0lGODlhAQABAIAAAP///////yH5BAEAAAEALAAAAAABAAEAAAICTAEAOw==",
        "sectionsAndIngredients": {
            "Ingredients": [
                "4 ears corn, shucked"
            ],
            "Marinade": [
                "4 tablespoons olive oil",
                "½ teaspoon garlic powder",
                "½ teaspoon paprika",
                "½ teaspoon freshly ground black pepper",
                "¼ teaspoon kosher salt"
            ],
            "Toppings": [
                "2 tablespoons finely grated Cotija cheese",
                "3 tablespoons chopped fresh cilantro",
                "1 ½ teaspoons paprika",
                "4 limes"
            ],
            "Special Equipment": [
                "sharp knife",
                "air fryer"
            ]
        },
        "servings": "for 4 servings",
        "description": "I grew up eating these at my local Mexican food truck every weekend and boy oh boy do I miss them! These elegant little “ribs” are a fun twist on a traditional dish and you can customize them however you’d like. These are great on the grill or air-fried.",
        "steps": [
            "Carefully break the ears of corn in half crosswise, then quarter lengthwise with a sharp knife.",
            "Make the marinade: In a small bowl, mix together the olive oil, garlic powder, paprika, black pepper, and salt into a bowl.",
            "In a large bowl, toss the corn ribs in the marinade until well-coated.",
            "Preheat the air fryer to 400°F (200°C) for 5 minutes.",
            "Working in batches, add the corn ribs to the air fryer basket, spacing a few centimeters apart. Cook for 10–12 minutes, or until golden brown.",
            "Toss the ribs with Cotija cheese, cilantro, paprika, and a squeeze of lime juice.",
            "Enjoy!"
        ],
        "tags": [
            "Cuisine",
            "North American",
            "Mexican",
            "Air Fryer",
            "Sides",
            "Appetizers",
            "Under 30 Minutes"
        ],
        "nutritionalInfo": [
            "Calories 317",
            "Fat 17g",
            "Carbs 42g",
            "Fiber 9g",
            "Sugar 8g",
            "Protein 7g"
        ]
    }
]